---
kind: method
id: M:Autodesk.Revit.DB.Surface.GetBoundingBoxUV
source: html/5084214f-219f-780f-fe03-f16b62b2660d.htm
---
# Autodesk.Revit.DB.Surface.GetBoundingBoxUV Method

Gets the UV bounding box of the surface.

## Syntax (C#)
```csharp
public BoundingBoxUV GetBoundingBoxUV()
```

## Returns
The UV bounding box of the surface.

## Remarks
The UV bounding box may not be set.